# Análise de dados com Python e Pandas
## Aula 4: Trabalhando com Datas

In [ ]:
# Importa a biblioteca Pandas
import pandas as pd

In [ ]:
# Lê os arquivos
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [ ]:
# Concatena todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [ ]:
# Exibe as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
# Exibe as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [ ]:
# Verifica os tipos de dados do DataFrame
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
# Altera o tipo de dado da coluna LojaID
df['LojaID'] = df['LojaID'].astype('object')
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

### Tratando valores faltantes

In [ ]:
# Consulta linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
# Substitui os valores nulos pela média
df['Vendas'].fillna(df['Vendas'].mean(), inplace=True)

In [ ]:
# Exibe uma umostra dos dados
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
42    Salvador 2019-01-01   44.28   1034     1
64   Fortaleza 2019-01-01  110.31   1005     4
8     Salvador 2019-02-11    4.96   1036     2
52      Recife 2019-01-01   11.87    981     6
51      Recife 2019-01-01  146.95    982     2
25   Fortaleza 2019-01-01   80.31   1004     4
76      Recife 2019-01-01   17.86    980     5
160      Natal 2019-01-02   11.76   1034     1
152      Natal 2019-01-02   20.07   1035     1
128      Natal 2019-01-02   36.84   1034     1
132     Recife 2019-03-02   17.49    983     5
122  Fortaleza 2019-03-02  235.06    983     3
129   Salvador 2019-03-02  125.66   1037     1
137   Salvador 2019-03-02   51.66   1036     3
183   Salvador 2019-01-02  120.23   1037     2

In [ ]:
# Substitui os valores nulos por 0
df['Vendas'].fillna(0, inplace=True)

In [ ]:
# Remove as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
# Remove as linhas com valores nulos com base em 1 coluna
df.dropna(subset=['Vendas'], inplace=True)

In [ ]:
# Remove as linhas que estejam com valores faltantes em todas as colunas
df.dropna(how='all', inplace=True)

### Criando novas colunas

In [ ]:
# Cria a coluna Receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
df["Receita/Venda"] = df["Receita"] / df["Vendas"]
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
0  Aracaju 2018-01-01  142.00   1520     1   142.00            1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26            6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55            1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07            7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08            8.0

In [ ]:
# Retorna a maior receita
df["Receita"].max()

3544.0

In [ ]:
# Retorna a menor receita
df["Receita"].min()

3.34

In [ ]:
# Retorna as 'n' maiores receitas
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
7   Natal 2019-03-18   886.0    853     4   3544.0            4.0
51  Natal 2018-01-21   859.0    852     4   3436.0            4.0
55  Natal 2019-01-08   859.0    854     4   3436.0            4.0

In [ ]:
# Retorna as 'n' menores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
118  Aracaju 2018-01-01    3.34   1522     1     3.34            1.0
65    Recife 2019-01-01    4.01    981     1     4.01            1.0
92     Natal 2019-01-02    4.57   1035     1     4.57            1.0

In [ ]:
# Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
# Exibe o conjunto de dados ordenado pela receita
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
7   Natal 2019-03-18   886.0    853     4   3544.0            4.0
55  Natal 2019-01-08   859.0    854     4   3436.0            4.0
51  Natal 2018-01-21   859.0    852     4   3436.0            4.0
30  Natal 2018-10-02   856.0    853     4   3424.0            4.0
41  Natal 2018-05-20   835.0    852     4   3340.0            4.0
38  Natal 2018-02-25   828.0    852     4   3312.0            4.0
10  Natal 2018-10-27   828.0    852     4   3312.0            4.0
69  Natal 2019-03-24   817.0    852     4   3268.0            4.0
62  Natal 2018-02-10   793.0    854     4   3172.0            4.0
52  Natal 2018-04-27   778.0    854     4   3112.0            4.0

### Trabalhando com datas

In [ ]:
# Transforma a coluna data em tipo inteiro
df['Data'] = df['Data'].astype('int64')

In [ ]:
# Verifica o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data               int64
Vendas           float64
LojaID            object
Qtde               int64
Receita          float64
Receita/Venda    float64
dtype: object

In [ ]:
# Transforma a coluna Data em DateTime
df['Data'] = pd.to_datetime(df['Data'])

In [ ]:
# Verifica o tipo de dado de cada coluna
df.dtypes

Cidade                   object
Data             datetime64[ns]
Vendas                  float64
LojaID                   object
Qtde                      int64
Receita                 float64
Receita/Venda           float64
dtype: object

In [ ]:
# Agrupa por ano
df.groupby(df['Data'].dt.year)['Receita'].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [ ]:
# Cria uma nova coluna Ano
df['Ano_Venda'] = df['Data'].dt.year
df.sample(5)

        Cidade       Data  Vendas  ... Receita  Receita/Venda  Ano_Venda
172      Natal 2019-01-02    6.70  ...    6.70            1.0       2019
30    Salvador 2019-01-01   47.96  ...   95.92            2.0       2019
89    Salvador 2019-01-01   17.46  ...   17.46            1.0       2019
86     Aracaju 2018-01-01  154.92  ...  774.60            5.0       2018
70   Fortaleza 2019-01-01   79.57  ...  397.85            5.0       2019

[5 rows x 8 columns]

In [ ]:
# Extrai o dia e o mês
df["Mes_Venda"], df["Dia_Venda"] = (df["Data"].dt.month, df["Data"].dt.day)
df.sample(5)

        Cidade       Data  Vendas  ... Ano_Venda  Mes_Venda  Dia_Venda
138      Natal 2019-01-02  212.03  ...      2019          1          2
9    Fortaleza 2019-01-01   11.17  ...      2019          1          1
8      Aracaju 2019-01-01   12.16  ...      2019          1          1
98   Fortaleza 2019-01-01   15.00  ...      2019          1          1
33   Fortaleza 2019-01-01   19.56  ...      2019          1          1

[5 rows x 10 columns]

In [ ]:
# Retorna a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [ ]:
# Calcula a diferença de dias
df["Diferenca_Dias"] = df["Data"] - df["Data"].min()
df.sample(5)

       Cidade       Data  Vendas  ... Mes_Venda  Dia_Venda  Diferenca_Dias
35      Natal 2018-01-18  552.00  ...         1         18         17 days
234  Salvador 2019-01-03   48.39  ...         1          3        367 days
219  Salvador 2019-01-02   19.67  ...         1          2        366 days
135     Natal 2019-01-02    9.95  ...         1          2        366 days
92   Salvador 2019-01-01    4.57  ...         1          1        365 days

[5 rows x 11 columns]

In [ ]:
# Cria a coluna de trimestre
df["Trimestre_Venda"] = df["Data"].dt.quarter
df.sample(5)

       Cidade       Data  Vendas  ... Dia_Venda  Diferenca_Dias  Trimestre_Venda
137    Recife 2019-03-02   51.99  ...         2        425 days                1
26    Aracaju 2018-01-01    6.98  ...         1          0 days                1
103  Salvador 2019-01-01  191.60  ...         1        365 days                1
193     Natal 2019-01-02    3.97  ...         2        366 days                1
47    Aracaju 2018-01-01   80.46  ...         1          0 days                1

[5 rows x 12 columns]

In [ ]:
# Filtra as vendas de 2019 do mês de Março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]
vendas_marco_19.sample(10)

        Cidade       Data  Vendas  ... Dia_Venda  Diferenca_Dias  Trimestre_Venda
129  Fortaleza 2019-03-02   35.34  ...         2        425 days                1
111     Recife 2019-03-02    8.00  ...         2        425 days                1
133  Fortaleza 2019-03-02   14.67  ...         2        425 days                1
112   Salvador 2019-03-02   43.00  ...         2        425 days                1
2        Natal 2019-03-11  308.00  ...        11        434 days                1
4        Natal 2019-03-09  699.00  ...         9        432 days                1
108   Salvador 2019-03-02   11.72  ...         2        425 days                1
66       Natal 2019-03-24  559.00  ...        24        447 days                1
137   Salvador 2019-03-02   51.66  ...         2        425 days                1
124     Recife 2019-03-02   47.98  ...         2        425 days                1

[10 rows x 12 columns]

FIM